Autodesk.Revit.DB.ExtensibleStorage.Schema.WriteAccessGranted
Checks whether Entities of this Schema may be stored by the current add-in.
Returns:
True if write access is allowed.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.ReadAccessGranted
Checks whether Entities of this Schema may be retrieved by the current add-in.
Returns:
True if read access is allowed.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.ListFields
The complete list of fields in the Schema, sorted by name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Reading of Entities of this Schema is not allowed to the current add-in.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.GetField(System.String)
Gets a Field of a given name from the Schema.
name:
The Field name
Returns:
The Field
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Reading of Entities of this Schema is not allowed to the current add-in.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.EraseSchemaAndAllEntities(Autodesk.Revit.DB.ExtensibleStorage.Schema,System.Boolean)
Erases all Entities corresponding to this Schema from all open documents, and erases
this Schema from memory.
Remarks:
The intent of this method is to let the user control the amount of memory consumed
by Extensible Storage data. It may also be useful during development.
Obviously, this method cannot erase the Schema from closed documents, so if a saved
and closed document contains Entities of this Schema, it will reintroduce it into
memory.
Top-level Entities corresponding to this Schema are erased; subentities are replaced
with invalid Entities. It may be tempting to use this method to replace subentities
such that the GUID is the same, but the Schema definition is different. This will
break schema uniqueness when a new Schema is already in memory, and the old one is in
a newly opened file. Never assign the same GUID to different Schemas.  This method will not
erase schemas or entities in embedded families.
schema:
The Schema to erase.
overrideWriteAccessWithUserPermission:
Normally, the usual write access controls apply to prevent deletion of Entities that
you don't have write permissions for. However, the user may choose to override the
controls. Set this flag to true only if the user gave explicit permission to destroy
the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No write access to this Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.ListSchemas
Lists all schemas in memory.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.Lookup(System.Guid)
Finds the Schema corresponding to the GUID in memory.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.Schema.Documentation
The overall description of the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.VendorId
The id of the third-party vendor that may access entities of this Schema under the
Vendor access level.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.ApplicationGUID
The GUID of the application or add-in that may access entities of this Schema under the
Application access level.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.WriteAccessLevel
Write access level of the schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.ReadAccessLevel
Read access level of the schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.SchemaName
The user-friendly name of the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema.GUID
The identifier of the Schema.
Setter made unavailable, because it would violate set-correctness
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Schema
The description of a single object (Entity) in the Extensible Storage framework. Contains
identity information, documentation and the list of fields to be stored in the Entity.
Remarks:
A Schema is similar to a class in most object-oriented languages, or to a C struct,
while an Entity is an object of that class.
The Schema object is immutable. To create and populate a Schema, use the SchemaBuilder
class. Schemas are stored in the memory of the running instance of Revit and may be
retrieved with the Lookup method.
When a document containing Entities of a Schema is saved, the Schema is saved with the
document too. Opening that document reintroduces the Schema into memory.
As you plan to store your data in Revit, please be aware that the data will be
stored in Revit elements. Overwhelming the Revit database will impact performance and
stability, and will make the user unhappy. Also, remember that multiple add-ins may be
storing their data simultaneously. Several kB per element or several MB per file
are reasonable maximums for one add-in. If you have larger requirements, consider storing
them in a separate database (such as SQLite) and storing keys into that database in Revit.
Since:
2012